app/controllers/categories_controller.rb

SELECT * FROM "categories" WHERE ("categories".user_id = 1) ORDER BY categories.created_at ASC
SELECT sum("categories".focus_count) AS sum_focus_count FROM "categories" WHERE ("categories".user_id = 1)
---
  def index
    @categories         = current_user.categories
    @category           = Category.new
    @everything_count   = current_user.categories.sum(:task_count)

SELECT * FROM "categories" WHERE ("categories"."id" = 1 AND ("categories".user_id = 1)) ORDER BY categories.created_at ASC
---
  def show
    @category = current_user.categories.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at", "user_id", "focus_count", "task_count") VALUES('Something', '2010-08-09 00:06:37', '2010-08-09 00:06:37', 1, 0, 0)
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if current_user.categories << @category