app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1 AND ("tasks".user_id = 1))
---
  def show
    @task = @category.tasks.find(params[:id])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 7 AND ("tasks".category_id = 2)) ORDER BY tasks.created_at ASC
---
  def complete
    @task = @category.tasks.find(params[:id])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 7 AND ("tasks".category_id = 2)) ORDER BY tasks.created_at ASC
---
  def undo
    @task = @category.tasks.find(params[:id])

INSERT INTO "tasks" ("name", "created_at", "aasm_state", "updated_at", "focus", "category_id") VALUES('Build wireframe of homepage.', '2010-08-09 07:53:01', 'incomplete', '2010-08-09 07:53:01', 0, 1)
---
  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @category and @category.tasks << @task