app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES('6JqeiRxM6pmnLg5X455C', '2010-08-03 04:51:00', '2010-08-03 04:51:00', '8ad530fcd84578c8c46baaa4d3a2059c456eeebf5462e4b4bbca91949154dc74fb7b5fcac1dc6f0617642e61ee455a245fc9b81e1787e4f4a4869678a8c732f4', 'pIZB99ZeJhgO6NIYN4wg', '2010-08-03 04:51:00', 0, '127.0.0.1', 'SXKk9JZrduoxpc5la8Bs', '2010-08-03 04:51:00', 'c6fc76bd6c8a02407998da4c91b1ae9b8307a845b06cc65488950b47b498ac6f7a8c1e3a98935840b2f5fd28536f9c144b5b03311634b695271bca6e4e7c7695', 1, NULL, 'jimjeffers', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save